dijkstrw/wearlink_nrf58122/main.c
#define APP_FEATURE_NOT_SUPPORTED       BLE_GATT_STATUS_ATTERR_APP_BEGIN + 2            /**< Reply when unsupported features are requested. */

#define BASE_USB_HID_SPEC_VERSION        0x0101                                         /**< Version number of base USB HID Specification implemented by this application. */

#define DEAD_BEEF                        0xDEADBEEF                                     /**< Value used as error code on stack dump, can be used to identify stack location on stack unwind. */

#define SCHED_MAX_EVENT_DATA_SIZE        MAX(APP_TIMER_SCHED_EVT_SIZE,\
                                             BLE_STACK_HANDLER_SCHED_EVT_SIZE)          /**< Maximum size of scheduler events. */
#define SCHED_QUEUE_SIZE                 10                                             /**< Maximum number of events in the scheduler queue. */

#define KEYPAD_POWER_PIN                  2
#define KEYPAD_ADC_PIN                    NRF_ADC_CONFIG_INPUT_2                        /**< Pin P0.01 */
#define KEYPAD_SENSE_PIN                  4
#define KEYPAD_NUMKEYS                    5

typedef enum
{
    BLE_NO_ADV,               /**< No advertising running. */
    BLE_DIRECTED_ADV,         /**< Direct advertising to the latest central. */
    BLE_FAST_ADV_WHITELIST,   /**< Advertising with whitelist. */
    BLE_FAST_ADV,             /**< Fast advertising running. */
    BLE_SLOW_ADV,             /**< Slow advertising running. */
    BLE_SLEEP,                /**< Go to system-off. */
} ble_advertising_mode_t;

static ble_hids_t                        m_hids;                                        /**< Structure used to identify the HID service. */
static ble_bas_t                         m_bas;                                         /**< Structure used to identify the battery service. */

static uint16_t                          m_conn_handle = BLE_CONN_HANDLE_INVALID;       /**< Handle of the current connection. */

static sensorsim_cfg_t                   m_battery_sim_cfg;                             /**< Battery Level sensor simulator configuration. */
static sensorsim_state_t                 m_battery_sim_state;                           /**< Battery Level sensor simulator state. */

APP_TIMER_DEF(m_battery_timer_id);                                                      /**< Battery timer. */

APP_TIMER_DEF(m_adc_timer_id);

static dm_application_instance_t         m_app_handle;                                  /**< Application identifier allocated by device manager. */
static dm_handle_t                       m_bonded_peer_handle;                          /**< Device reference handle to the current bonded central. */


static ble_uuid_t m_adv_uuids[] = {{BLE_UUID_HUMAN_INTERFACE_DEVICE_SERVICE, BLE_UUID_TYPE_BLE}};

/*
  Fibretronics wearlink is a string of push button (no) switches individually
  in series with a resistor. When no button is pressed it is open
  circuit. When one button is pressed, the resistance corresponding to that
  key is present between the two feed wires.

  To determine the value for the adc we calculate ideal adc reading based on
  the known/measured resistance per button.

  Additional wrinkles;
  - ADC reference is VBG = 1.2V
  - ADC prescaling = 1/3
  - ADC input impendance is ~390k
  - ADC sampling time is 20us @ 8 bits, 68us @ 10 bit

  Schematic:

   Vcc--Rk---x----Rl--gnd
             |
            Ra
             |
           Vref/2

   Where:
   Rk = key resistance
   Rl = limit or load resistance, makes a Rk + Rl load when not sampling
   Ra = the adc impedance at sampling time
   Ua = voltage at point x

   Ik = Il + Ia = Vcc / Rk
   Ia = (Ua - (Vref / 2)) / Rain
   Il = Ua / Rl

   Solve for Ua: Ua = (-Vcc - ((Vref / 2) / Ra)) / (-1 - (Rk / Ra) - (Rk / Rl))

  #+ORGTBL: SEND keymarks orgtbl-to-generic :lstart "   { " :lend " }," :sep ", ", :skip 4 :skipcols (3 4 5 6 7)
  | ! | Key                           |       Rk |         Uau |      Ua |   Vscaled |      Adc |   A-D% |    A+D% |
  |   |                               |          |   unsampled | sampled |           |          |        |         |
  |---+-------------------------------+----------+-------------+---------+-----------+----------+--------+---------|
  | # | RELEASE_KEY                   | 10000000 |       0.007 |   0.036 |     0.012 |        3 |      3 |       3 |
  | # | CONSUMER_CTRL_VOL_DW          |    10000 |       2.200 |   2.173 |     0.724 |      154 |    146 |     162 |
  | # | CONSUMER_CTRL_SCAN_PREV_TRACK |    20000 |       1.650 |   1.624 |     0.541 |      115 |    109 |     121 |
  | # | CONSUMER_CTRL_PLAY            |    47000 |       0.985 |   0.972 |     0.324 |       69 |     66 |      72 |
  | # | CONSUMER_CTRL_SCAN_NEXT_TRACK |    30000 |       1.320 |   1.298 |     0.433 |       92 |     87 |      97 |
  | # | CONSUMER_CTRL_VOL_UP          |     5600 |       2.578 |   2.556 |     0.852 |      182 |    173 |     191 |
  |---+-------------------------------+----------+-------------+---------+-----------+----------+--------+---------|
  | $ | Vcc=3.3                       | Rl=20000 | Rain=389200 |         | scale=1/3 | Vref=1.2 | bits=8 | dev=.05 |
  #+TBLFM: $4=($Rl/($Rk+$Rl))*$Vcc;%.3f::$5=(-(($Vref/2)*$3)/$Rain-$Vcc)/((-$3/$Rain)-($3/$Rl)-1);%.3f::$6=$Ua*$scale;%.3f::$7=$Vscaled/($Vref/2^$bits);%.0f::$8=max($7-($dev*$7),0);%.0f::$9=min($7+($dev*$7),2^$bits);%0.f
*/

typedef enum
{
    RELEASE_KEY                     = 0x00,
    CONSUMER_CTRL_PLAY              = 0x01,
    CONSUMER_CTRL_ALCCC             = 0x02,
    CONSUMER_CTRL_SCAN_NEXT_TRACK   = 0x04,
    CONSUMER_CTRL_SCAN_PREV_TRACK   = 0x08,
    CONSUMER_CTRL_VOL_DW            = 0x10,
    CONSUMER_CTRL_VOL_UP            = 0x20,
    CONSUMER_CTRL_AC_FORWARD        = 0x40,
    CONSUMER_CTRL_AC_BACK           = 0x80,
} consumer_control_t;

const struct keymark {
    uint8_t key;
    uint8_t low;
    uint8_t high;
} keymark[KEYPAD_NUMKEYS] = {
/* BEGIN RECEIVE ORGTBL keymarks */
   { CONSUMER_CTRL_VOL_DW, 146, 162 },
   { CONSUMER_CTRL_SCAN_PREV_TRACK, 109, 121 },
   { CONSUMER_CTRL_PLAY, 66, 72 },
   { CONSUMER_CTRL_SCAN_NEXT_TRACK, 87, 97 },
   { CONSUMER_CTRL_VOL_UP, 173, 191 },
/* END RECEIVE ORGTBL keymarks */
};
volatile int32_t adc_sample;

