dijkstrw/wearlink_nrf58122/main.c
    err_code = dm_register(&m_app_handle, &register_param);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing buttons and leds.
 *
 * @param[out] p_erase_bonds  Will be true if the clear bonding button was pressed to wake the application up.
 */
static void buttons_leds_init(bool * p_erase_bonds)
{
    bsp_event_t startup_event;

    uint32_t err_code = bsp_init(BSP_INIT_LED | BSP_INIT_BUTTONS,
                                 APP_TIMER_TICKS(100, APP_TIMER_PRESCALER),
                                 bsp_event_handler);
    APP_ERROR_CHECK(err_code);

    err_code = bsp_btn_ble_init(NULL, &startup_event);
    APP_ERROR_CHECK(err_code);

    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}

/**@brief Function for the Power manager.
 */
static void power_manage(void)
{
    uint32_t err_code = sd_app_evt_wait();
    APP_ERROR_CHECK(err_code);
}

static void adc_init(void) {
    const nrf_adc_config_t nrf_adc_config = {
        .resolution = NRF_ADC_CONFIG_RES_8BIT,
        .scaling = NRF_ADC_CONFIG_SCALING_INPUT_ONE_THIRD,
        .reference = NRF_ADC_CONFIG_REF_VBG
    };

    nrf_adc_configure((nrf_adc_config_t *)&nrf_adc_config);
    nrf_adc_input_select(KEYPAD_ADC_PIN);
    nrf_adc_int_enable(ADC_INTENSET_END_Enabled << ADC_INTENSET_END_Pos);
    NVIC_SetPriority(ADC_IRQn, NRF_APP_PRIORITY_HIGH);
    NVIC_EnableIRQ(ADC_IRQn);
    adc_sample = -1;
}

void ADC_IRQHandler(void) {
    nrf_adc_conversion_event_clean();

    adc_sample = nrf_adc_result_get();
}

static void adc_timeout_handler(void *p_context)
{
    uint8_t i;
    UNUSED_PARAMETER(p_context);

    app_trace_log("adc %d\r\n", (int)adc_sample);
    for (i = 0; i < KEYPAD_NUMKEYS; i++) {
        if ((keymark[i].low <= adc_sample) &&
            (keymark[i].high >= adc_sample)) {
            app_trace_log("cc key %d\r\n", keymark[i].key);
            consumer_control_send(keymark[i].key);
            return;
        }
    }

    /* no key matched, send release */
    consumer_control_send(RELEASE_KEY);
    app_trace_log("cc key release\r\n");
}

static void keypad_power_init(void)
{
    nrf_gpio_cfg_output(KEYPAD_POWER_PIN);
    nrf_gpio_pin_set(KEYPAD_POWER_PIN);
}

static void
keypad_sensed_handler(nrf_drv_gpiote_pin_t pin, nrf_gpiote_polarity_t action)
{
    app_trace_log("key change sensed\r\n");
    nrf_adc_start();
    app_timer_start(m_adc_timer_id, ADC_MEAS_INTERVAL, NULL);
}

static void keypad_keypress_detection_init(void)
{
    uint32_t err_code;
    nrf_drv_gpiote_in_config_t config = GPIOTE_CONFIG_IN_SENSE_TOGGLE(false);

    err_code = nrf_drv_gpiote_in_init(KEYPAD_SENSE_PIN, &config, keypad_sensed_handler);
    APP_ERROR_CHECK(err_code);
    nrf_drv_gpiote_in_event_enable(KEYPAD_SENSE_PIN, false);
}

/**@brief Function for application main entry.
 */
int main(void)
{
    bool erase_bonds;
    uint32_t err_code;

    // Initialize.
    app_trace_init();
    timers_init();
    buttons_leds_init(&erase_bonds);

    keypad_power_init();
    buttons_init();
    adc_init();
    keypad_keypress_detection_init();

    ble_stack_init();
    scheduler_init();
    device_manager_init(erase_bonds);
    gap_params_init();
    advertising_init();
    services_init();
    sensor_simulator_init();
    conn_params_init();

    // Start execution.
    timers_start();
    err_code = ble_advertising_start(BLE_ADV_MODE_FAST);
    APP_ERROR_CHECK(err_code);

    // Enter main loop.
    for (;;)
    {
        app_sched_execute();
        power_manage();
    }
}

/**
 * @}
 */
